package msc.lesson2;

public class Main3 {
    public static void main(String[] args) {
        // циклы
        // Задача: напечатать на консоль 10 раз слово Привет

        // 10 20 шаг 1
        // 50 60 шаг 1
        // 100 120 шаг 2
        // 0 10 шаг 1

        for (int i = 0; i > 10; i++) {
            System.out.println("Привет!");
        }
    }



}
